Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/**
 * \file IfxEmem_ram_reg.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 *
 * Date: 2015-12-17 16:15:02 GMT
 * Version: TBD
 * Specification: TBD
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Emem_ram_Registers_Cfg Emem_ram address
 * \ingroup IfxLld_Emem_ram_Registers
 * 
 * \defgroup IfxLld_Emem_ram_Registers_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Emem_ram_Registers_Cfg
 *
 * \defgroup IfxLld_Emem_ram_Registers_Cfg_Ememram0 2-EMEMRAM0
 * \ingroup IfxLld_Emem_ram_Registers_Cfg
 *
 * \defgroup IfxLld_Emem_ram_Registers_Cfg_Ememram1 2-EMEMRAM1
 * \ingroup IfxLld_Emem_ram_Registers_Cfg
 *
 * \defgroup IfxLld_Emem_ram_Registers_Cfg_Ememram2 2-EMEMRAM2
 * \ingroup IfxLld_Emem_ram_Registers_Cfg
 *
 * \defgroup IfxLld_Emem_ram_Registers_Cfg_Ememram3 2-EMEMRAM3
 * \ingroup IfxLld_Emem_ram_Registers_Cfg
 *
 *
 */
#ifndef IFXEMEM_RAM_REG_H
#define IFXEMEM_RAM_REG_H 1
/******************************************************************************/
#include "IfxEmemram_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_Cfg_BaseAddress
 * \{  */

/** \brief EMEM_RAM object */
#define MODULE_EMEMRAM0 /*lint --e(923)*/ ((*(Ifx_EMEM_RAM*)0x99000000u))
#define MODULE_EMEMRAM1 /*lint --e(923)*/ ((*(Ifx_EMEM_RAM*)0x99100000u))
#define MODULE_EMEMRAM2 /*lint --e(923)*/ ((*(Ifx_EMEM_RAM*)0x99200000u))
#define MODULE_EMEMRAM3 /*lint --e(923)*/ ((*(Ifx_EMEM_RAM*)0x99300000u))
/** \}  */

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_Cfg_Ememram0
 * \{  */
/** \brief 0, EMEM Clock Control Register */
#define EMEMRAM0_CLC /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_CLC*)0xFB000000u)

/** \brief 8, EMEM Module ID Register */
#define EMEMRAM0_MODID /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_MODID*)0xFB000008u)

/** \brief 10, EMEM Access Enable Register 0 */
#define EMEMRAM0_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_ACCEN0*)0xFB000010u)

/** \brief 14, EMEM Access Enable Register 1 */
#define EMEMRAM0_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_ACCEN1*)0xFB000014u)

/** \brief 20, EMEM Memory Control Register */
#define EMEMRAM0_MEMCON /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_MEMCON*)0xFB000020u)

/** \brief 24, EMEM Safety Control Register */
#define EMEMRAM0_SCTRL /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_SCTRL*)0xFB000024u)

/** \brief 50, EMEM Region Lower Address Register */
#define EMEMRAM0_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB000050u)
/** Alias (User Manual Name) for EMEMRAM0_RGN0_LA.
* To use register names with standard convension, please use EMEMRAM0_RGN0_LA.
*/
#define EMEMRAM0_RGNLA0 (EMEMRAM0_RGN0_LA)

/** \brief 54, EMEM Region Upper Address Register */
#define EMEMRAM0_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB000054u)
/** Alias (User Manual Name) for EMEMRAM0_RGN0_UA.
* To use register names with standard convension, please use EMEMRAM0_RGN0_UA.
*/
#define EMEMRAM0_RGNUA0 (EMEMRAM0_RGN0_UA)

/** \brief 58, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGN0_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB000058u)
/** Alias (User Manual Name) for EMEMRAM0_RGN0_ACCENWA.
* To use register names with standard convension, please use EMEMRAM0_RGN0_ACCENWA.
*/
#define EMEMRAM0_RGNACCENWA0 (EMEMRAM0_RGN0_ACCENWA)

/** \brief 5C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGN0_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB00005Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGN0_ACCENWB.
* To use register names with standard convension, please use EMEMRAM0_RGN0_ACCENWB.
*/
#define EMEMRAM0_RGNACCENWB0 (EMEMRAM0_RGN0_ACCENWB)

/** \brief 60, EMEM Region Lower Address Register */
#define EMEMRAM0_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB000060u)
/** Alias (User Manual Name) for EMEMRAM0_RGN1_LA.
* To use register names with standard convension, please use EMEMRAM0_RGN1_LA.
*/
#define EMEMRAM0_RGNLA1 (EMEMRAM0_RGN1_LA)

/** \brief 64, EMEM Region Upper Address Register */
#define EMEMRAM0_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB000064u)
/** Alias (User Manual Name) for EMEMRAM0_RGN1_UA.
* To use register names with standard convension, please use EMEMRAM0_RGN1_UA.
*/
#define EMEMRAM0_RGNUA1 (EMEMRAM0_RGN1_UA)

/** \brief 68, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGN1_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB000068u)
/** Alias (User Manual Name) for EMEMRAM0_RGN1_ACCENWA.
* To use register names with standard convension, please use EMEMRAM0_RGN1_ACCENWA.
*/
#define EMEMRAM0_RGNACCENWA1 (EMEMRAM0_RGN1_ACCENWA)

/** \brief 6C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGN1_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB00006Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGN1_ACCENWB.
* To use register names with standard convension, please use EMEMRAM0_RGN1_ACCENWB.
*/
#define EMEMRAM0_RGNACCENWB1 (EMEMRAM0_RGN1_ACCENWB)

/** \brief 70, EMEM Region Lower Address Register */
#define EMEMRAM0_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB000070u)
/** Alias (User Manual Name) for EMEMRAM0_RGN2_LA.
* To use register names with standard convension, please use EMEMRAM0_RGN2_LA.
*/
#define EMEMRAM0_RGNLA2 (EMEMRAM0_RGN2_LA)

/** \brief 74, EMEM Region Upper Address Register */
#define EMEMRAM0_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB000074u)
/** Alias (User Manual Name) for EMEMRAM0_RGN2_UA.
* To use register names with standard convension, please use EMEMRAM0_RGN2_UA.
*/
#define EMEMRAM0_RGNUA2 (EMEMRAM0_RGN2_UA)

/** \brief 78, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGN2_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB000078u)
/** Alias (User Manual Name) for EMEMRAM0_RGN2_ACCENWA.
* To use register names with standard convension, please use EMEMRAM0_RGN2_ACCENWA.
*/
#define EMEMRAM0_RGNACCENWA2 (EMEMRAM0_RGN2_ACCENWA)

/** \brief 7C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGN2_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB00007Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGN2_ACCENWB.
* To use register names with standard convension, please use EMEMRAM0_RGN2_ACCENWB.
*/
#define EMEMRAM0_RGNACCENWB2 (EMEMRAM0_RGN2_ACCENWB)

/** \brief 80, EMEM Region Lower Address Register */
#define EMEMRAM0_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB000080u)
/** Alias (User Manual Name) for EMEMRAM0_RGN3_LA.
* To use register names with standard convension, please use EMEMRAM0_RGN3_LA.
*/
#define EMEMRAM0_RGNLA3 (EMEMRAM0_RGN3_LA)

/** \brief 84, EMEM Region Upper Address Register */
#define EMEMRAM0_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB000084u)
/** Alias (User Manual Name) for EMEMRAM0_RGN3_UA.
* To use register names with standard convension, please use EMEMRAM0_RGN3_UA.
*/
#define EMEMRAM0_RGNUA3 (EMEMRAM0_RGN3_UA)

/** \brief 88, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGN3_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB000088u)
/** Alias (User Manual Name) for EMEMRAM0_RGN3_ACCENWA.
* To use register names with standard convension, please use EMEMRAM0_RGN3_ACCENWA.
*/
#define EMEMRAM0_RGNACCENWA3 (EMEMRAM0_RGN3_ACCENWA)

/** \brief 8C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGN3_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB00008Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGN3_ACCENWB.
* To use register names with standard convension, please use EMEMRAM0_RGN3_ACCENWB.
*/
#define EMEMRAM0_RGNACCENWB3 (EMEMRAM0_RGN3_ACCENWB)

