Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/** \brief 90, EMEM Region Lower Address Register */
#define EMEMRAM0_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB000090u)
/** Alias (User Manual Name) for EMEMRAM0_RGN4_LA.
* To use register names with standard convension, please use EMEMRAM0_RGN4_LA.
*/
#define EMEMRAM0_RGNLA4 (EMEMRAM0_RGN4_LA)

/** \brief 94, EMEM Region Upper Address Register */
#define EMEMRAM0_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB000094u)
/** Alias (User Manual Name) for EMEMRAM0_RGN4_UA.
* To use register names with standard convension, please use EMEMRAM0_RGN4_UA.
*/
#define EMEMRAM0_RGNUA4 (EMEMRAM0_RGN4_UA)

/** \brief 98, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGN4_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB000098u)
/** Alias (User Manual Name) for EMEMRAM0_RGN4_ACCENWA.
* To use register names with standard convension, please use EMEMRAM0_RGN4_ACCENWA.
*/
#define EMEMRAM0_RGNACCENWA4 (EMEMRAM0_RGN4_ACCENWA)

/** \brief 9C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGN4_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB00009Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGN4_ACCENWB.
* To use register names with standard convension, please use EMEMRAM0_RGN4_ACCENWB.
*/
#define EMEMRAM0_RGNACCENWB4 (EMEMRAM0_RGN4_ACCENWB)

/** \brief A0, EMEM Region Lower Address Register */
#define EMEMRAM0_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0000A0u)
/** Alias (User Manual Name) for EMEMRAM0_RGN5_LA.
* To use register names with standard convension, please use EMEMRAM0_RGN5_LA.
*/
#define EMEMRAM0_RGNLA5 (EMEMRAM0_RGN5_LA)

/** \brief A4, EMEM Region Upper Address Register */
#define EMEMRAM0_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0000A4u)
/** Alias (User Manual Name) for EMEMRAM0_RGN5_UA.
* To use register names with standard convension, please use EMEMRAM0_RGN5_UA.
*/
#define EMEMRAM0_RGNUA5 (EMEMRAM0_RGN5_UA)

/** \brief A8, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGN5_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0000A8u)
/** Alias (User Manual Name) for EMEMRAM0_RGN5_ACCENWA.
* To use register names with standard convension, please use EMEMRAM0_RGN5_ACCENWA.
*/
#define EMEMRAM0_RGNACCENWA5 (EMEMRAM0_RGN5_ACCENWA)

/** \brief AC, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGN5_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0000ACu)
/** Alias (User Manual Name) for EMEMRAM0_RGN5_ACCENWB.
* To use register names with standard convension, please use EMEMRAM0_RGN5_ACCENWB.
*/
#define EMEMRAM0_RGNACCENWB5 (EMEMRAM0_RGN5_ACCENWB)

/** \brief B0, EMEM Region Lower Address Register */
#define EMEMRAM0_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0000B0u)
/** Alias (User Manual Name) for EMEMRAM0_RGN6_LA.
* To use register names with standard convension, please use EMEMRAM0_RGN6_LA.
*/
#define EMEMRAM0_RGNLA6 (EMEMRAM0_RGN6_LA)

/** \brief B4, EMEM Region Upper Address Register */
#define EMEMRAM0_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0000B4u)
/** Alias (User Manual Name) for EMEMRAM0_RGN6_UA.
* To use register names with standard convension, please use EMEMRAM0_RGN6_UA.
*/
#define EMEMRAM0_RGNUA6 (EMEMRAM0_RGN6_UA)

/** \brief B8, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGN6_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0000B8u)
/** Alias (User Manual Name) for EMEMRAM0_RGN6_ACCENWA.
* To use register names with standard convension, please use EMEMRAM0_RGN6_ACCENWA.
*/
#define EMEMRAM0_RGNACCENWA6 (EMEMRAM0_RGN6_ACCENWA)

/** \brief BC, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGN6_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0000BCu)
/** Alias (User Manual Name) for EMEMRAM0_RGN6_ACCENWB.
* To use register names with standard convension, please use EMEMRAM0_RGN6_ACCENWB.
*/
#define EMEMRAM0_RGNACCENWB6 (EMEMRAM0_RGN6_ACCENWB)

/** \brief C0, EMEM Region Lower Address Register */
#define EMEMRAM0_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0000C0u)
/** Alias (User Manual Name) for EMEMRAM0_RGN7_LA.
* To use register names with standard convension, please use EMEMRAM0_RGN7_LA.
*/
#define EMEMRAM0_RGNLA7 (EMEMRAM0_RGN7_LA)

/** \brief C4, EMEM Region Upper Address Register */
#define EMEMRAM0_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0000C4u)
/** Alias (User Manual Name) for EMEMRAM0_RGN7_UA.
* To use register names with standard convension, please use EMEMRAM0_RGN7_UA.
*/
#define EMEMRAM0_RGNUA7 (EMEMRAM0_RGN7_UA)

/** \brief C8, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGN7_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0000C8u)
/** Alias (User Manual Name) for EMEMRAM0_RGN7_ACCENWA.
* To use register names with standard convension, please use EMEMRAM0_RGN7_ACCENWA.
*/
#define EMEMRAM0_RGNACCENWA7 (EMEMRAM0_RGN7_ACCENWA)

/** \brief CC, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGN7_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0000CCu)
/** Alias (User Manual Name) for EMEMRAM0_RGN7_ACCENWB.
* To use register names with standard convension, please use EMEMRAM0_RGN7_ACCENWB.
*/
#define EMEMRAM0_RGNACCENWB7 (EMEMRAM0_RGN7_ACCENWB)

/** \brief D8, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGNACCEN0_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0000D8u)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN0_RA.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN0_RA.
*/
#define EMEMRAM0_RGNACCENRA0 (EMEMRAM0_RGNACCEN0_RA)

/** \brief DC, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGNACCEN0_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0000DCu)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN0_RB.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN0_RB.
*/
#define EMEMRAM0_RGNACCENWRB0 (EMEMRAM0_RGNACCEN0_RB)

/** \brief E8, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGNACCEN1_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0000E8u)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN1_RA.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN1_RA.
*/
#define EMEMRAM0_RGNACCENRA1 (EMEMRAM0_RGNACCEN1_RA)

