Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/** \brief EC, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0000ECu)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN1_RB.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN1_RB.
*/
#define EMEMRAM0_RGNACCENWRB1 (EMEMRAM0_RGNACCEN1_RB)

/** \brief F8, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0000F8u)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN2_RA.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN2_RA.
*/
#define EMEMRAM0_RGNACCENRA2 (EMEMRAM0_RGNACCEN2_RA)

/** \brief FC, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0000FCu)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN2_RB.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN2_RB.
*/
#define EMEMRAM0_RGNACCENWRB2 (EMEMRAM0_RGNACCEN2_RB)

/** \brief 108, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB000108u)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN3_RA.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN3_RA.
*/
#define EMEMRAM0_RGNACCENRA3 (EMEMRAM0_RGNACCEN3_RA)

/** \brief 10C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB00010Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN3_RB.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN3_RB.
*/
#define EMEMRAM0_RGNACCENWRB3 (EMEMRAM0_RGNACCEN3_RB)

/** \brief 118, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB000118u)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN4_RA.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN4_RA.
*/
#define EMEMRAM0_RGNACCENRA4 (EMEMRAM0_RGNACCEN4_RA)

/** \brief 11C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB00011Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN4_RB.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN4_RB.
*/
#define EMEMRAM0_RGNACCENWRB4 (EMEMRAM0_RGNACCEN4_RB)

/** \brief 128, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB000128u)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN5_RA.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN5_RA.
*/
#define EMEMRAM0_RGNACCENRA5 (EMEMRAM0_RGNACCEN5_RA)

/** \brief 12C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB00012Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN5_RB.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN5_RB.
*/
#define EMEMRAM0_RGNACCENWRB5 (EMEMRAM0_RGNACCEN5_RB)

/** \brief 138, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB000138u)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN6_RA.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN6_RA.
*/
#define EMEMRAM0_RGNACCENRA6 (EMEMRAM0_RGNACCEN6_RA)

/** \brief 13C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB00013Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN6_RB.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN6_RB.
*/
#define EMEMRAM0_RGNACCENWRB6 (EMEMRAM0_RGNACCEN6_RB)

/** \brief 148, EMEM Region Access Enable Register 0 */
#define EMEMRAM0_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB000148u)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN7_RA.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN7_RA.
*/
#define EMEMRAM0_RGNACCENRA7 (EMEMRAM0_RGNACCEN7_RA)

/** \brief 14C, EMEM Region Access Enable Register 1 */
#define EMEMRAM0_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB00014Cu)
/** Alias (User Manual Name) for EMEMRAM0_RGNACCEN7_RB.
* To use register names with standard convension, please use EMEMRAM0_RGNACCEN7_RB.
*/
#define EMEMRAM0_RGNACCENWRB7 (EMEMRAM0_RGNACCEN7_RB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_Cfg_Ememram1
 * \{  */
/** \brief 0, EMEM Clock Control Register */
#define EMEMRAM1_CLC /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_CLC*)0xFB010000u)

/** \brief 8, EMEM Module ID Register */
#define EMEMRAM1_MODID /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_MODID*)0xFB010008u)

/** \brief 10, EMEM Access Enable Register 0 */
#define EMEMRAM1_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_ACCEN0*)0xFB010010u)

/** \brief 14, EMEM Access Enable Register 1 */
#define EMEMRAM1_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_ACCEN1*)0xFB010014u)

/** \brief 20, EMEM Memory Control Register */
#define EMEMRAM1_MEMCON /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_MEMCON*)0xFB010020u)

/** \brief 24, EMEM Safety Control Register */
#define EMEMRAM1_SCTRL /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_SCTRL*)0xFB010024u)

/** \brief 50, EMEM Region Lower Address Register */
#define EMEMRAM1_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB010050u)
/** Alias (User Manual Name) for EMEMRAM1_RGN0_LA.
* To use register names with standard convension, please use EMEMRAM1_RGN0_LA.
*/
#define EMEMRAM1_RGNLA0 (EMEMRAM1_RGN0_LA)

/** \brief 54, EMEM Region Upper Address Register */
#define EMEMRAM1_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB010054u)
/** Alias (User Manual Name) for EMEMRAM1_RGN0_UA.
* To use register names with standard convension, please use EMEMRAM1_RGN0_UA.
*/
#define EMEMRAM1_RGNUA0 (EMEMRAM1_RGN0_UA)

/** \brief 58, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGN0_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB010058u)
/** Alias (User Manual Name) for EMEMRAM1_RGN0_ACCENWA.
* To use register names with standard convension, please use EMEMRAM1_RGN0_ACCENWA.
*/
#define EMEMRAM1_RGNACCENWA0 (EMEMRAM1_RGN0_ACCENWA)

