Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/** \brief 5C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGN0_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB01005Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGN0_ACCENWB.
* To use register names with standard convension, please use EMEMRAM1_RGN0_ACCENWB.
*/
#define EMEMRAM1_RGNACCENWB0 (EMEMRAM1_RGN0_ACCENWB)

/** \brief 60, EMEM Region Lower Address Register */
#define EMEMRAM1_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB010060u)
/** Alias (User Manual Name) for EMEMRAM1_RGN1_LA.
* To use register names with standard convension, please use EMEMRAM1_RGN1_LA.
*/
#define EMEMRAM1_RGNLA1 (EMEMRAM1_RGN1_LA)

/** \brief 64, EMEM Region Upper Address Register */
#define EMEMRAM1_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB010064u)
/** Alias (User Manual Name) for EMEMRAM1_RGN1_UA.
* To use register names with standard convension, please use EMEMRAM1_RGN1_UA.
*/
#define EMEMRAM1_RGNUA1 (EMEMRAM1_RGN1_UA)

/** \brief 68, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGN1_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB010068u)
/** Alias (User Manual Name) for EMEMRAM1_RGN1_ACCENWA.
* To use register names with standard convension, please use EMEMRAM1_RGN1_ACCENWA.
*/
#define EMEMRAM1_RGNACCENWA1 (EMEMRAM1_RGN1_ACCENWA)

/** \brief 6C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGN1_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB01006Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGN1_ACCENWB.
* To use register names with standard convension, please use EMEMRAM1_RGN1_ACCENWB.
*/
#define EMEMRAM1_RGNACCENWB1 (EMEMRAM1_RGN1_ACCENWB)

/** \brief 70, EMEM Region Lower Address Register */
#define EMEMRAM1_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB010070u)
/** Alias (User Manual Name) for EMEMRAM1_RGN2_LA.
* To use register names with standard convension, please use EMEMRAM1_RGN2_LA.
*/
#define EMEMRAM1_RGNLA2 (EMEMRAM1_RGN2_LA)

/** \brief 74, EMEM Region Upper Address Register */
#define EMEMRAM1_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB010074u)
/** Alias (User Manual Name) for EMEMRAM1_RGN2_UA.
* To use register names with standard convension, please use EMEMRAM1_RGN2_UA.
*/
#define EMEMRAM1_RGNUA2 (EMEMRAM1_RGN2_UA)

/** \brief 78, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGN2_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB010078u)
/** Alias (User Manual Name) for EMEMRAM1_RGN2_ACCENWA.
* To use register names with standard convension, please use EMEMRAM1_RGN2_ACCENWA.
*/
#define EMEMRAM1_RGNACCENWA2 (EMEMRAM1_RGN2_ACCENWA)

/** \brief 7C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGN2_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB01007Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGN2_ACCENWB.
* To use register names with standard convension, please use EMEMRAM1_RGN2_ACCENWB.
*/
#define EMEMRAM1_RGNACCENWB2 (EMEMRAM1_RGN2_ACCENWB)

/** \brief 80, EMEM Region Lower Address Register */
#define EMEMRAM1_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB010080u)
/** Alias (User Manual Name) for EMEMRAM1_RGN3_LA.
* To use register names with standard convension, please use EMEMRAM1_RGN3_LA.
*/
#define EMEMRAM1_RGNLA3 (EMEMRAM1_RGN3_LA)

/** \brief 84, EMEM Region Upper Address Register */
#define EMEMRAM1_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB010084u)
/** Alias (User Manual Name) for EMEMRAM1_RGN3_UA.
* To use register names with standard convension, please use EMEMRAM1_RGN3_UA.
*/
#define EMEMRAM1_RGNUA3 (EMEMRAM1_RGN3_UA)

/** \brief 88, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGN3_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB010088u)
/** Alias (User Manual Name) for EMEMRAM1_RGN3_ACCENWA.
* To use register names with standard convension, please use EMEMRAM1_RGN3_ACCENWA.
*/
#define EMEMRAM1_RGNACCENWA3 (EMEMRAM1_RGN3_ACCENWA)

/** \brief 8C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGN3_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB01008Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGN3_ACCENWB.
* To use register names with standard convension, please use EMEMRAM1_RGN3_ACCENWB.
*/
#define EMEMRAM1_RGNACCENWB3 (EMEMRAM1_RGN3_ACCENWB)

/** \brief 90, EMEM Region Lower Address Register */
#define EMEMRAM1_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB010090u)
/** Alias (User Manual Name) for EMEMRAM1_RGN4_LA.
* To use register names with standard convension, please use EMEMRAM1_RGN4_LA.
*/
#define EMEMRAM1_RGNLA4 (EMEMRAM1_RGN4_LA)

/** \brief 94, EMEM Region Upper Address Register */
#define EMEMRAM1_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB010094u)
/** Alias (User Manual Name) for EMEMRAM1_RGN4_UA.
* To use register names with standard convension, please use EMEMRAM1_RGN4_UA.
*/
#define EMEMRAM1_RGNUA4 (EMEMRAM1_RGN4_UA)

/** \brief 98, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGN4_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB010098u)
/** Alias (User Manual Name) for EMEMRAM1_RGN4_ACCENWA.
* To use register names with standard convension, please use EMEMRAM1_RGN4_ACCENWA.
*/
#define EMEMRAM1_RGNACCENWA4 (EMEMRAM1_RGN4_ACCENWA)

/** \brief 9C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGN4_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB01009Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGN4_ACCENWB.
* To use register names with standard convension, please use EMEMRAM1_RGN4_ACCENWB.
*/
#define EMEMRAM1_RGNACCENWB4 (EMEMRAM1_RGN4_ACCENWB)

/** \brief A0, EMEM Region Lower Address Register */
#define EMEMRAM1_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0100A0u)
/** Alias (User Manual Name) for EMEMRAM1_RGN5_LA.
* To use register names with standard convension, please use EMEMRAM1_RGN5_LA.
*/
#define EMEMRAM1_RGNLA5 (EMEMRAM1_RGN5_LA)

/** \brief A4, EMEM Region Upper Address Register */
#define EMEMRAM1_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0100A4u)
/** Alias (User Manual Name) for EMEMRAM1_RGN5_UA.
* To use register names with standard convension, please use EMEMRAM1_RGN5_UA.
*/
#define EMEMRAM1_RGNUA5 (EMEMRAM1_RGN5_UA)

/** \brief A8, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGN5_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0100A8u)
/** Alias (User Manual Name) for EMEMRAM1_RGN5_ACCENWA.
* To use register names with standard convension, please use EMEMRAM1_RGN5_ACCENWA.
*/
#define EMEMRAM1_RGNACCENWA5 (EMEMRAM1_RGN5_ACCENWA)

/** \brief AC, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGN5_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0100ACu)
/** Alias (User Manual Name) for EMEMRAM1_RGN5_ACCENWB.
* To use register names with standard convension, please use EMEMRAM1_RGN5_ACCENWB.
*/
#define EMEMRAM1_RGNACCENWB5 (EMEMRAM1_RGN5_ACCENWB)

/** \brief B0, EMEM Region Lower Address Register */
#define EMEMRAM1_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0100B0u)
/** Alias (User Manual Name) for EMEMRAM1_RGN6_LA.
* To use register names with standard convension, please use EMEMRAM1_RGN6_LA.
*/
#define EMEMRAM1_RGNLA6 (EMEMRAM1_RGN6_LA)

/** \brief B4, EMEM Region Upper Address Register */
#define EMEMRAM1_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0100B4u)
/** Alias (User Manual Name) for EMEMRAM1_RGN6_UA.
* To use register names with standard convension, please use EMEMRAM1_RGN6_UA.
*/
#define EMEMRAM1_RGNUA6 (EMEMRAM1_RGN6_UA)

/** \brief B8, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGN6_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0100B8u)
/** Alias (User Manual Name) for EMEMRAM1_RGN6_ACCENWA.
* To use register names with standard convension, please use EMEMRAM1_RGN6_ACCENWA.
*/
#define EMEMRAM1_RGNACCENWA6 (EMEMRAM1_RGN6_ACCENWA)

