Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/** \brief BC, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGN6_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0100BCu)
/** Alias (User Manual Name) for EMEMRAM1_RGN6_ACCENWB.
* To use register names with standard convension, please use EMEMRAM1_RGN6_ACCENWB.
*/
#define EMEMRAM1_RGNACCENWB6 (EMEMRAM1_RGN6_ACCENWB)

/** \brief C0, EMEM Region Lower Address Register */
#define EMEMRAM1_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0100C0u)
/** Alias (User Manual Name) for EMEMRAM1_RGN7_LA.
* To use register names with standard convension, please use EMEMRAM1_RGN7_LA.
*/
#define EMEMRAM1_RGNLA7 (EMEMRAM1_RGN7_LA)

/** \brief C4, EMEM Region Upper Address Register */
#define EMEMRAM1_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0100C4u)
/** Alias (User Manual Name) for EMEMRAM1_RGN7_UA.
* To use register names with standard convension, please use EMEMRAM1_RGN7_UA.
*/
#define EMEMRAM1_RGNUA7 (EMEMRAM1_RGN7_UA)

/** \brief C8, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGN7_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0100C8u)
/** Alias (User Manual Name) for EMEMRAM1_RGN7_ACCENWA.
* To use register names with standard convension, please use EMEMRAM1_RGN7_ACCENWA.
*/
#define EMEMRAM1_RGNACCENWA7 (EMEMRAM1_RGN7_ACCENWA)

/** \brief CC, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGN7_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0100CCu)
/** Alias (User Manual Name) for EMEMRAM1_RGN7_ACCENWB.
* To use register names with standard convension, please use EMEMRAM1_RGN7_ACCENWB.
*/
#define EMEMRAM1_RGNACCENWB7 (EMEMRAM1_RGN7_ACCENWB)

/** \brief D8, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGNACCEN0_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0100D8u)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN0_RA.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN0_RA.
*/
#define EMEMRAM1_RGNACCENRA0 (EMEMRAM1_RGNACCEN0_RA)

/** \brief DC, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGNACCEN0_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0100DCu)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN0_RB.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN0_RB.
*/
#define EMEMRAM1_RGNACCENWRB0 (EMEMRAM1_RGNACCEN0_RB)

/** \brief E8, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGNACCEN1_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0100E8u)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN1_RA.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN1_RA.
*/
#define EMEMRAM1_RGNACCENRA1 (EMEMRAM1_RGNACCEN1_RA)

/** \brief EC, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0100ECu)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN1_RB.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN1_RB.
*/
#define EMEMRAM1_RGNACCENWRB1 (EMEMRAM1_RGNACCEN1_RB)

/** \brief F8, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0100F8u)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN2_RA.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN2_RA.
*/
#define EMEMRAM1_RGNACCENRA2 (EMEMRAM1_RGNACCEN2_RA)

/** \brief FC, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0100FCu)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN2_RB.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN2_RB.
*/
#define EMEMRAM1_RGNACCENWRB2 (EMEMRAM1_RGNACCEN2_RB)

/** \brief 108, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB010108u)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN3_RA.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN3_RA.
*/
#define EMEMRAM1_RGNACCENRA3 (EMEMRAM1_RGNACCEN3_RA)

/** \brief 10C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB01010Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN3_RB.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN3_RB.
*/
#define EMEMRAM1_RGNACCENWRB3 (EMEMRAM1_RGNACCEN3_RB)

/** \brief 118, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB010118u)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN4_RA.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN4_RA.
*/
#define EMEMRAM1_RGNACCENRA4 (EMEMRAM1_RGNACCEN4_RA)

/** \brief 11C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB01011Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN4_RB.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN4_RB.
*/
#define EMEMRAM1_RGNACCENWRB4 (EMEMRAM1_RGNACCEN4_RB)

/** \brief 128, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB010128u)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN5_RA.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN5_RA.
*/
#define EMEMRAM1_RGNACCENRA5 (EMEMRAM1_RGNACCEN5_RA)

/** \brief 12C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB01012Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN5_RB.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN5_RB.
*/
#define EMEMRAM1_RGNACCENWRB5 (EMEMRAM1_RGNACCEN5_RB)

/** \brief 138, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB010138u)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN6_RA.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN6_RA.
*/
#define EMEMRAM1_RGNACCENRA6 (EMEMRAM1_RGNACCEN6_RA)

/** \brief 13C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB01013Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN6_RB.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN6_RB.
*/
#define EMEMRAM1_RGNACCENWRB6 (EMEMRAM1_RGNACCEN6_RB)

/** \brief 148, EMEM Region Access Enable Register 0 */
#define EMEMRAM1_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB010148u)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN7_RA.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN7_RA.
*/
#define EMEMRAM1_RGNACCENRA7 (EMEMRAM1_RGNACCEN7_RA)

/** \brief 14C, EMEM Region Access Enable Register 1 */
#define EMEMRAM1_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB01014Cu)
/** Alias (User Manual Name) for EMEMRAM1_RGNACCEN7_RB.
* To use register names with standard convension, please use EMEMRAM1_RGNACCEN7_RB.
*/
#define EMEMRAM1_RGNACCENWRB7 (EMEMRAM1_RGNACCEN7_RB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_Cfg_Ememram2
 * \{  */
/** \brief 0, EMEM Clock Control Register */
#define EMEMRAM2_CLC /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_CLC*)0xFB020000u)

