Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/** \brief 8, EMEM Module ID Register */
#define EMEMRAM2_MODID /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_MODID*)0xFB020008u)

/** \brief 10, EMEM Access Enable Register 0 */
#define EMEMRAM2_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_ACCEN0*)0xFB020010u)

/** \brief 14, EMEM Access Enable Register 1 */
#define EMEMRAM2_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_ACCEN1*)0xFB020014u)

/** \brief 20, EMEM Memory Control Register */
#define EMEMRAM2_MEMCON /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_MEMCON*)0xFB020020u)

/** \brief 24, EMEM Safety Control Register */
#define EMEMRAM2_SCTRL /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_SCTRL*)0xFB020024u)

/** \brief 50, EMEM Region Lower Address Register */
#define EMEMRAM2_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB020050u)
/** Alias (User Manual Name) for EMEMRAM2_RGN0_LA.
* To use register names with standard convension, please use EMEMRAM2_RGN0_LA.
*/
#define EMEMRAM2_RGNLA0 (EMEMRAM2_RGN0_LA)

/** \brief 54, EMEM Region Upper Address Register */
#define EMEMRAM2_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB020054u)
/** Alias (User Manual Name) for EMEMRAM2_RGN0_UA.
* To use register names with standard convension, please use EMEMRAM2_RGN0_UA.
*/
#define EMEMRAM2_RGNUA0 (EMEMRAM2_RGN0_UA)

/** \brief 58, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGN0_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB020058u)
/** Alias (User Manual Name) for EMEMRAM2_RGN0_ACCENWA.
* To use register names with standard convension, please use EMEMRAM2_RGN0_ACCENWA.
*/
#define EMEMRAM2_RGNACCENWA0 (EMEMRAM2_RGN0_ACCENWA)

/** \brief 5C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGN0_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB02005Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGN0_ACCENWB.
* To use register names with standard convension, please use EMEMRAM2_RGN0_ACCENWB.
*/
#define EMEMRAM2_RGNACCENWB0 (EMEMRAM2_RGN0_ACCENWB)

/** \brief 60, EMEM Region Lower Address Register */
#define EMEMRAM2_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB020060u)
/** Alias (User Manual Name) for EMEMRAM2_RGN1_LA.
* To use register names with standard convension, please use EMEMRAM2_RGN1_LA.
*/
#define EMEMRAM2_RGNLA1 (EMEMRAM2_RGN1_LA)

/** \brief 64, EMEM Region Upper Address Register */
#define EMEMRAM2_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB020064u)
/** Alias (User Manual Name) for EMEMRAM2_RGN1_UA.
* To use register names with standard convension, please use EMEMRAM2_RGN1_UA.
*/
#define EMEMRAM2_RGNUA1 (EMEMRAM2_RGN1_UA)

/** \brief 68, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGN1_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB020068u)
/** Alias (User Manual Name) for EMEMRAM2_RGN1_ACCENWA.
* To use register names with standard convension, please use EMEMRAM2_RGN1_ACCENWA.
*/
#define EMEMRAM2_RGNACCENWA1 (EMEMRAM2_RGN1_ACCENWA)

/** \brief 6C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGN1_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB02006Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGN1_ACCENWB.
* To use register names with standard convension, please use EMEMRAM2_RGN1_ACCENWB.
*/
#define EMEMRAM2_RGNACCENWB1 (EMEMRAM2_RGN1_ACCENWB)

/** \brief 70, EMEM Region Lower Address Register */
#define EMEMRAM2_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB020070u)
/** Alias (User Manual Name) for EMEMRAM2_RGN2_LA.
* To use register names with standard convension, please use EMEMRAM2_RGN2_LA.
*/
#define EMEMRAM2_RGNLA2 (EMEMRAM2_RGN2_LA)

/** \brief 74, EMEM Region Upper Address Register */
#define EMEMRAM2_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB020074u)
/** Alias (User Manual Name) for EMEMRAM2_RGN2_UA.
* To use register names with standard convension, please use EMEMRAM2_RGN2_UA.
*/
#define EMEMRAM2_RGNUA2 (EMEMRAM2_RGN2_UA)

/** \brief 78, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGN2_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB020078u)
/** Alias (User Manual Name) for EMEMRAM2_RGN2_ACCENWA.
* To use register names with standard convension, please use EMEMRAM2_RGN2_ACCENWA.
*/
#define EMEMRAM2_RGNACCENWA2 (EMEMRAM2_RGN2_ACCENWA)

/** \brief 7C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGN2_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB02007Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGN2_ACCENWB.
* To use register names with standard convension, please use EMEMRAM2_RGN2_ACCENWB.
*/
#define EMEMRAM2_RGNACCENWB2 (EMEMRAM2_RGN2_ACCENWB)

/** \brief 80, EMEM Region Lower Address Register */
#define EMEMRAM2_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB020080u)
/** Alias (User Manual Name) for EMEMRAM2_RGN3_LA.
* To use register names with standard convension, please use EMEMRAM2_RGN3_LA.
*/
#define EMEMRAM2_RGNLA3 (EMEMRAM2_RGN3_LA)

/** \brief 84, EMEM Region Upper Address Register */
#define EMEMRAM2_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB020084u)
/** Alias (User Manual Name) for EMEMRAM2_RGN3_UA.
* To use register names with standard convension, please use EMEMRAM2_RGN3_UA.
*/
#define EMEMRAM2_RGNUA3 (EMEMRAM2_RGN3_UA)

/** \brief 88, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGN3_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB020088u)
/** Alias (User Manual Name) for EMEMRAM2_RGN3_ACCENWA.
* To use register names with standard convension, please use EMEMRAM2_RGN3_ACCENWA.
*/
#define EMEMRAM2_RGNACCENWA3 (EMEMRAM2_RGN3_ACCENWA)

/** \brief 8C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGN3_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB02008Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGN3_ACCENWB.
* To use register names with standard convension, please use EMEMRAM2_RGN3_ACCENWB.
*/
#define EMEMRAM2_RGNACCENWB3 (EMEMRAM2_RGN3_ACCENWB)

