Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/** \brief EC, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0200ECu)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN1_RB.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN1_RB.
*/
#define EMEMRAM2_RGNACCENWRB1 (EMEMRAM2_RGNACCEN1_RB)

/** \brief F8, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0200F8u)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN2_RA.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN2_RA.
*/
#define EMEMRAM2_RGNACCENRA2 (EMEMRAM2_RGNACCEN2_RA)

/** \brief FC, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0200FCu)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN2_RB.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN2_RB.
*/
#define EMEMRAM2_RGNACCENWRB2 (EMEMRAM2_RGNACCEN2_RB)

/** \brief 108, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB020108u)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN3_RA.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN3_RA.
*/
#define EMEMRAM2_RGNACCENRA3 (EMEMRAM2_RGNACCEN3_RA)

/** \brief 10C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB02010Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN3_RB.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN3_RB.
*/
#define EMEMRAM2_RGNACCENWRB3 (EMEMRAM2_RGNACCEN3_RB)

/** \brief 118, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB020118u)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN4_RA.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN4_RA.
*/
#define EMEMRAM2_RGNACCENRA4 (EMEMRAM2_RGNACCEN4_RA)

/** \brief 11C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB02011Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN4_RB.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN4_RB.
*/
#define EMEMRAM2_RGNACCENWRB4 (EMEMRAM2_RGNACCEN4_RB)

/** \brief 128, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB020128u)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN5_RA.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN5_RA.
*/
#define EMEMRAM2_RGNACCENRA5 (EMEMRAM2_RGNACCEN5_RA)

/** \brief 12C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB02012Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN5_RB.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN5_RB.
*/
#define EMEMRAM2_RGNACCENWRB5 (EMEMRAM2_RGNACCEN5_RB)

/** \brief 138, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB020138u)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN6_RA.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN6_RA.
*/
#define EMEMRAM2_RGNACCENRA6 (EMEMRAM2_RGNACCEN6_RA)

/** \brief 13C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB02013Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN6_RB.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN6_RB.
*/
#define EMEMRAM2_RGNACCENWRB6 (EMEMRAM2_RGNACCEN6_RB)

/** \brief 148, EMEM Region Access Enable Register 0 */
#define EMEMRAM2_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB020148u)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN7_RA.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN7_RA.
*/
#define EMEMRAM2_RGNACCENRA7 (EMEMRAM2_RGNACCEN7_RA)

/** \brief 14C, EMEM Region Access Enable Register 1 */
#define EMEMRAM2_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB02014Cu)
/** Alias (User Manual Name) for EMEMRAM2_RGNACCEN7_RB.
* To use register names with standard convension, please use EMEMRAM2_RGNACCEN7_RB.
*/
#define EMEMRAM2_RGNACCENWRB7 (EMEMRAM2_RGNACCEN7_RB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Emem_ram_Cfg_Ememram3
 * \{  */
/** \brief 0, EMEM Clock Control Register */
#define EMEMRAM3_CLC /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_CLC*)0xFB030000u)

/** \brief 8, EMEM Module ID Register */
#define EMEMRAM3_MODID /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_MODID*)0xFB030008u)

/** \brief 10, EMEM Access Enable Register 0 */
#define EMEMRAM3_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_ACCEN0*)0xFB030010u)

/** \brief 14, EMEM Access Enable Register 1 */
#define EMEMRAM3_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_ACCEN1*)0xFB030014u)

/** \brief 20, EMEM Memory Control Register */
#define EMEMRAM3_MEMCON /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_MEMCON*)0xFB030020u)

/** \brief 24, EMEM Safety Control Register */
#define EMEMRAM3_SCTRL /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_SCTRL*)0xFB030024u)

/** \brief 50, EMEM Region Lower Address Register */
#define EMEMRAM3_RGN0_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB030050u)
/** Alias (User Manual Name) for EMEMRAM3_RGN0_LA.
* To use register names with standard convension, please use EMEMRAM3_RGN0_LA.
*/
#define EMEMRAM3_RGNLA0 (EMEMRAM3_RGN0_LA)

/** \brief 54, EMEM Region Upper Address Register */
#define EMEMRAM3_RGN0_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB030054u)
/** Alias (User Manual Name) for EMEMRAM3_RGN0_UA.
* To use register names with standard convension, please use EMEMRAM3_RGN0_UA.
*/
#define EMEMRAM3_RGNUA0 (EMEMRAM3_RGN0_UA)

/** \brief 58, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGN0_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB030058u)
/** Alias (User Manual Name) for EMEMRAM3_RGN0_ACCENWA.
* To use register names with standard convension, please use EMEMRAM3_RGN0_ACCENWA.
*/
#define EMEMRAM3_RGNACCENWA0 (EMEMRAM3_RGN0_ACCENWA)

