Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/** \brief 5C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGN0_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB03005Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGN0_ACCENWB.
* To use register names with standard convension, please use EMEMRAM3_RGN0_ACCENWB.
*/
#define EMEMRAM3_RGNACCENWB0 (EMEMRAM3_RGN0_ACCENWB)

/** \brief 60, EMEM Region Lower Address Register */
#define EMEMRAM3_RGN1_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB030060u)
/** Alias (User Manual Name) for EMEMRAM3_RGN1_LA.
* To use register names with standard convension, please use EMEMRAM3_RGN1_LA.
*/
#define EMEMRAM3_RGNLA1 (EMEMRAM3_RGN1_LA)

/** \brief 64, EMEM Region Upper Address Register */
#define EMEMRAM3_RGN1_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB030064u)
/** Alias (User Manual Name) for EMEMRAM3_RGN1_UA.
* To use register names with standard convension, please use EMEMRAM3_RGN1_UA.
*/
#define EMEMRAM3_RGNUA1 (EMEMRAM3_RGN1_UA)

/** \brief 68, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGN1_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB030068u)
/** Alias (User Manual Name) for EMEMRAM3_RGN1_ACCENWA.
* To use register names with standard convension, please use EMEMRAM3_RGN1_ACCENWA.
*/
#define EMEMRAM3_RGNACCENWA1 (EMEMRAM3_RGN1_ACCENWA)

/** \brief 6C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGN1_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB03006Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGN1_ACCENWB.
* To use register names with standard convension, please use EMEMRAM3_RGN1_ACCENWB.
*/
#define EMEMRAM3_RGNACCENWB1 (EMEMRAM3_RGN1_ACCENWB)

/** \brief 70, EMEM Region Lower Address Register */
#define EMEMRAM3_RGN2_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB030070u)
/** Alias (User Manual Name) for EMEMRAM3_RGN2_LA.
* To use register names with standard convension, please use EMEMRAM3_RGN2_LA.
*/
#define EMEMRAM3_RGNLA2 (EMEMRAM3_RGN2_LA)

/** \brief 74, EMEM Region Upper Address Register */
#define EMEMRAM3_RGN2_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB030074u)
/** Alias (User Manual Name) for EMEMRAM3_RGN2_UA.
* To use register names with standard convension, please use EMEMRAM3_RGN2_UA.
*/
#define EMEMRAM3_RGNUA2 (EMEMRAM3_RGN2_UA)

/** \brief 78, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGN2_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB030078u)
/** Alias (User Manual Name) for EMEMRAM3_RGN2_ACCENWA.
* To use register names with standard convension, please use EMEMRAM3_RGN2_ACCENWA.
*/
#define EMEMRAM3_RGNACCENWA2 (EMEMRAM3_RGN2_ACCENWA)

/** \brief 7C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGN2_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB03007Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGN2_ACCENWB.
* To use register names with standard convension, please use EMEMRAM3_RGN2_ACCENWB.
*/
#define EMEMRAM3_RGNACCENWB2 (EMEMRAM3_RGN2_ACCENWB)

/** \brief 80, EMEM Region Lower Address Register */
#define EMEMRAM3_RGN3_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB030080u)
/** Alias (User Manual Name) for EMEMRAM3_RGN3_LA.
* To use register names with standard convension, please use EMEMRAM3_RGN3_LA.
*/
#define EMEMRAM3_RGNLA3 (EMEMRAM3_RGN3_LA)

/** \brief 84, EMEM Region Upper Address Register */
#define EMEMRAM3_RGN3_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB030084u)
/** Alias (User Manual Name) for EMEMRAM3_RGN3_UA.
* To use register names with standard convension, please use EMEMRAM3_RGN3_UA.
*/
#define EMEMRAM3_RGNUA3 (EMEMRAM3_RGN3_UA)

/** \brief 88, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGN3_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB030088u)
/** Alias (User Manual Name) for EMEMRAM3_RGN3_ACCENWA.
* To use register names with standard convension, please use EMEMRAM3_RGN3_ACCENWA.
*/
#define EMEMRAM3_RGNACCENWA3 (EMEMRAM3_RGN3_ACCENWA)

/** \brief 8C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGN3_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB03008Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGN3_ACCENWB.
* To use register names with standard convension, please use EMEMRAM3_RGN3_ACCENWB.
*/
#define EMEMRAM3_RGNACCENWB3 (EMEMRAM3_RGN3_ACCENWB)

/** \brief 90, EMEM Region Lower Address Register */
#define EMEMRAM3_RGN4_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB030090u)
/** Alias (User Manual Name) for EMEMRAM3_RGN4_LA.
* To use register names with standard convension, please use EMEMRAM3_RGN4_LA.
*/
#define EMEMRAM3_RGNLA4 (EMEMRAM3_RGN4_LA)

/** \brief 94, EMEM Region Upper Address Register */
#define EMEMRAM3_RGN4_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB030094u)
/** Alias (User Manual Name) for EMEMRAM3_RGN4_UA.
* To use register names with standard convension, please use EMEMRAM3_RGN4_UA.
*/
#define EMEMRAM3_RGNUA4 (EMEMRAM3_RGN4_UA)

/** \brief 98, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGN4_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB030098u)
/** Alias (User Manual Name) for EMEMRAM3_RGN4_ACCENWA.
* To use register names with standard convension, please use EMEMRAM3_RGN4_ACCENWA.
*/
#define EMEMRAM3_RGNACCENWA4 (EMEMRAM3_RGN4_ACCENWA)

/** \brief 9C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGN4_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB03009Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGN4_ACCENWB.
* To use register names with standard convension, please use EMEMRAM3_RGN4_ACCENWB.
*/
#define EMEMRAM3_RGNACCENWB4 (EMEMRAM3_RGN4_ACCENWB)

/** \brief A0, EMEM Region Lower Address Register */
#define EMEMRAM3_RGN5_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0300A0u)
/** Alias (User Manual Name) for EMEMRAM3_RGN5_LA.
* To use register names with standard convension, please use EMEMRAM3_RGN5_LA.
*/
#define EMEMRAM3_RGNLA5 (EMEMRAM3_RGN5_LA)

/** \brief A4, EMEM Region Upper Address Register */
#define EMEMRAM3_RGN5_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0300A4u)
/** Alias (User Manual Name) for EMEMRAM3_RGN5_UA.
* To use register names with standard convension, please use EMEMRAM3_RGN5_UA.
*/
#define EMEMRAM3_RGNUA5 (EMEMRAM3_RGN5_UA)

/** \brief A8, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGN5_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0300A8u)
/** Alias (User Manual Name) for EMEMRAM3_RGN5_ACCENWA.
* To use register names with standard convension, please use EMEMRAM3_RGN5_ACCENWA.
*/
#define EMEMRAM3_RGNACCENWA5 (EMEMRAM3_RGN5_ACCENWA)

/** \brief AC, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGN5_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0300ACu)
/** Alias (User Manual Name) for EMEMRAM3_RGN5_ACCENWB.
* To use register names with standard convension, please use EMEMRAM3_RGN5_ACCENWB.
*/
#define EMEMRAM3_RGNACCENWB5 (EMEMRAM3_RGN5_ACCENWB)

/** \brief B0, EMEM Region Lower Address Register */
#define EMEMRAM3_RGN6_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0300B0u)
/** Alias (User Manual Name) for EMEMRAM3_RGN6_LA.
* To use register names with standard convension, please use EMEMRAM3_RGN6_LA.
*/
#define EMEMRAM3_RGNLA6 (EMEMRAM3_RGN6_LA)

/** \brief B4, EMEM Region Upper Address Register */
#define EMEMRAM3_RGN6_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0300B4u)
/** Alias (User Manual Name) for EMEMRAM3_RGN6_UA.
* To use register names with standard convension, please use EMEMRAM3_RGN6_UA.
*/
#define EMEMRAM3_RGNUA6 (EMEMRAM3_RGN6_UA)

/** \brief B8, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGN6_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0300B8u)
/** Alias (User Manual Name) for EMEMRAM3_RGN6_ACCENWA.
* To use register names with standard convension, please use EMEMRAM3_RGN6_ACCENWA.
*/
#define EMEMRAM3_RGNACCENWA6 (EMEMRAM3_RGN6_ACCENWA)

