Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEmemram_reg.h
/** \brief BC, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGN6_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0300BCu)
/** Alias (User Manual Name) for EMEMRAM3_RGN6_ACCENWB.
* To use register names with standard convension, please use EMEMRAM3_RGN6_ACCENWB.
*/
#define EMEMRAM3_RGNACCENWB6 (EMEMRAM3_RGN6_ACCENWB)

/** \brief C0, EMEM Region Lower Address Register */
#define EMEMRAM3_RGN7_LA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_LA*)0xFB0300C0u)
/** Alias (User Manual Name) for EMEMRAM3_RGN7_LA.
* To use register names with standard convension, please use EMEMRAM3_RGN7_LA.
*/
#define EMEMRAM3_RGNLA7 (EMEMRAM3_RGN7_LA)

/** \brief C4, EMEM Region Upper Address Register */
#define EMEMRAM3_RGN7_UA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_UA*)0xFB0300C4u)
/** Alias (User Manual Name) for EMEMRAM3_RGN7_UA.
* To use register names with standard convension, please use EMEMRAM3_RGN7_UA.
*/
#define EMEMRAM3_RGNUA7 (EMEMRAM3_RGN7_UA)

/** \brief C8, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGN7_ACCENWA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWA*)0xFB0300C8u)
/** Alias (User Manual Name) for EMEMRAM3_RGN7_ACCENWA.
* To use register names with standard convension, please use EMEMRAM3_RGN7_ACCENWA.
*/
#define EMEMRAM3_RGNACCENWA7 (EMEMRAM3_RGN7_ACCENWA)

/** \brief CC, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGN7_ACCENWB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGN_ACCENWB*)0xFB0300CCu)
/** Alias (User Manual Name) for EMEMRAM3_RGN7_ACCENWB.
* To use register names with standard convension, please use EMEMRAM3_RGN7_ACCENWB.
*/
#define EMEMRAM3_RGNACCENWB7 (EMEMRAM3_RGN7_ACCENWB)

/** \brief D8, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGNACCEN0_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0300D8u)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN0_RA.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN0_RA.
*/
#define EMEMRAM3_RGNACCENRA0 (EMEMRAM3_RGNACCEN0_RA)

/** \brief DC, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGNACCEN0_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0300DCu)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN0_RB.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN0_RB.
*/
#define EMEMRAM3_RGNACCENWRB0 (EMEMRAM3_RGNACCEN0_RB)

/** \brief E8, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGNACCEN1_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0300E8u)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN1_RA.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN1_RA.
*/
#define EMEMRAM3_RGNACCENRA1 (EMEMRAM3_RGNACCEN1_RA)

/** \brief EC, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGNACCEN1_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0300ECu)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN1_RB.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN1_RB.
*/
#define EMEMRAM3_RGNACCENWRB1 (EMEMRAM3_RGNACCEN1_RB)

/** \brief F8, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGNACCEN2_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB0300F8u)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN2_RA.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN2_RA.
*/
#define EMEMRAM3_RGNACCENRA2 (EMEMRAM3_RGNACCEN2_RA)

/** \brief FC, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGNACCEN2_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB0300FCu)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN2_RB.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN2_RB.
*/
#define EMEMRAM3_RGNACCENWRB2 (EMEMRAM3_RGNACCEN2_RB)

/** \brief 108, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGNACCEN3_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB030108u)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN3_RA.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN3_RA.
*/
#define EMEMRAM3_RGNACCENRA3 (EMEMRAM3_RGNACCEN3_RA)

/** \brief 10C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGNACCEN3_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB03010Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN3_RB.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN3_RB.
*/
#define EMEMRAM3_RGNACCENWRB3 (EMEMRAM3_RGNACCEN3_RB)

/** \brief 118, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGNACCEN4_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB030118u)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN4_RA.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN4_RA.
*/
#define EMEMRAM3_RGNACCENRA4 (EMEMRAM3_RGNACCEN4_RA)

/** \brief 11C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGNACCEN4_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB03011Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN4_RB.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN4_RB.
*/
#define EMEMRAM3_RGNACCENWRB4 (EMEMRAM3_RGNACCEN4_RB)

/** \brief 128, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGNACCEN5_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB030128u)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN5_RA.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN5_RA.
*/
#define EMEMRAM3_RGNACCENRA5 (EMEMRAM3_RGNACCEN5_RA)

/** \brief 12C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGNACCEN5_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB03012Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN5_RB.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN5_RB.
*/
#define EMEMRAM3_RGNACCENWRB5 (EMEMRAM3_RGNACCEN5_RB)

/** \brief 138, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGNACCEN6_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB030138u)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN6_RA.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN6_RA.
*/
#define EMEMRAM3_RGNACCENRA6 (EMEMRAM3_RGNACCEN6_RA)

/** \brief 13C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGNACCEN6_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB03013Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN6_RB.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN6_RB.
*/
#define EMEMRAM3_RGNACCENWRB6 (EMEMRAM3_RGNACCEN6_RB)

/** \brief 148, EMEM Region Access Enable Register 0 */
#define EMEMRAM3_RGNACCEN7_RA /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RA*)0xFB030148u)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN7_RA.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN7_RA.
*/
#define EMEMRAM3_RGNACCENRA7 (EMEMRAM3_RGNACCEN7_RA)

/** \brief 14C, EMEM Region Access Enable Register 1 */
#define EMEMRAM3_RGNACCEN7_RB /*lint --e(923)*/ (*(volatile Ifx_EMEM_RAM_RGNACCEN_RB*)0xFB03014Cu)
/** Alias (User Manual Name) for EMEMRAM3_RGNACCEN7_RB.
* To use register names with standard convension, please use EMEMRAM3_RGNACCEN7_RB.
*/
#define EMEMRAM3_RGNACCENWRB7 (EMEMRAM3_RGNACCEN7_RB)

/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXEMEM_RAM_REG_H */
